In [1]:
#importing the datasets
import pandas as pd
import numpy as np

In [2]:
data = pd.read_csv('test-copy1.csv')

# Exploring Dataset

In [3]:
import pandas as pd
import numpy as np

In [4]:
test = pd.read_csv("test-Copy1.csv")

In [5]:
test.head()

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3
0,1000004,P00128942,M,46-50,7,B,2,1,1,11.0,NaN
1,1000009,P00113442,M,26-35,17,C,0,0,3,5.0,NaN
2,1000010,P00288442,F,36-45,1,B,4+,1,5,14.0,NaN
3,1000010,P00145342,F,36-45,1,B,4+,1,4,9.0,NaN
4,1000011,P00053842,F,26-35,1,C,1,0,4,5.0,12.0

In [6]:
test = pd.read_csv("test-Copy1.csv")

In [7]:
test = pd.read_csv("test-Copy1.csv")
test.tail()

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3
233594,1006036,P00118942,F,26-35,15,B,4+,1,8,NaN,NaN
233595,1006036,P00254642,F,26-35,15,B,4+,1,5,8.0,NaN
233596,1006036,P00031842,F,26-35,15,B,4+,1,1,5.0,12.0
233597,1006037,P00124742,F,46-50,1,C,4+,0,10,16.0,NaN
233598,1006039,P00316642,F,46-50,0,B,4+,1,4,5.0,NaN

In [8]:
test.keys()

Index(['User_ID', 'Product_ID', 'Gender', 'Age', 'Occupation', 'City_Category',
       'Stay_In_Current_City_Years', 'Marital_Status', 'Product_Category_1',
       'Product_Category_2', 'Product_Category_3'],
      dtype='object')

In [9]:
test.columns

Index(['User_ID', 'Product_ID', 'Gender', 'Age', 'Occupation', 'City_Category',
       'Stay_In_Current_City_Years', 'Marital_Status', 'Product_Category_1',
       'Product_Category_2', 'Product_Category_3'],
      dtype='object')

In [10]:
data.keys()

Index(['User_ID', 'Product_ID', 'Gender', 'Age', 'Occupation', 'City_Category',
       'Stay_In_Current_City_Years', 'Marital_Status', 'Product_Category_1',
       'Product_Category_2', 'Product_Category_3'],
      dtype='object')

In [11]:
data.columns

Index(['User_ID', 'Product_ID', 'Gender', 'Age', 'Occupation', 'City_Category',
       'Stay_In_Current_City_Years', 'Marital_Status', 'Product_Category_1',
       'Product_Category_2', 'Product_Category_3'],
      dtype='object')

# Pandas 
it is used to present documents in table format. it has two data types: a series and dataframe. Series is just one column while a dataframe is a combination of series. Series and dataframes usually have indexes.

In [12]:
#you can convert list, dict to dataframe
list_1 = [1,2,3,4,5,6,7,8,9]
series_1 = pd.Series(list_1)
print(series_1)

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
dtype: int64

In [13]:
#specifying the index
index  = ["a","b","c","d","e","f","g","h","i"]
data = [0,1,2,3,4,5,6,7,8]
new_series = pd.Series(data = data, index = index)
print(new_series)

a    0
b    1
c    2
d    3
e    4
f    5
g    6
h    7
i    8
dtype: int64

In [14]:
index[5]

'f'

In [15]:
data[5]

5

In [16]:
list_1 = [1,2,3,4,5,6,7,8,9]
new_series = pd.DataFrame(list_1)
print(new_series)

   0
0  1
1  2
2  3
3  4
4  5
5  6
6  7
7  8
8  9

In [17]:
index  = ["a","b","c","d","e","f","g","h","i"]
data = [0,1,2,3,4,5,6,7,8]
new_series = pd.DataFrame(data = data, index = index)
print(new_series)

   0
a  0
b  1
c  2
d  3
e  4
f  5
g  6
h  7
i  8

# Day 5

In [18]:
import pandas as pd

#Create a dictionary with four keys, each key should have a list of five elements
dict = {"A": [1,2,3,4,5], "B": [6,7,8,9,10], "C":[11,12,13,14,15], "D":[16,17,18,19,20] }
f2 = pd.DataFrame(dict)
f2

   A   B   C   D
0  1   6  11  16
1  2   7  12  17
2  3   8  13  18
3  4   9  14  19
4  5  10  15  20

In [19]:
index  = ["a","b","c","d","e"]
dict_= {"A": [1,2,3,4,5], "B": [6,7,8,9,10], "C":[11,12,13,14,15], "D":[16,17,18,19,20] }
f2 = pd.DataFrame(dict_, index)
f2

   A   B   C   D
a  1   6  11  16
b  2   7  12  17
c  3   8  13  18
d  4   9  14  19
e  5  10  15  20

# Count Method
This counts the number of values in each column of the dataframe.

In [20]:
f2.count()

A    5
B    5
C    5
D    5
dtype: int64

# set_index Method
the set index method is used to set a column within the dataframe as an index

In [21]:
clas = {'first name':["sophia","alaba","ronke","peace","olu","seth","laba","dike","buhari","luke","olu"]
      ,'sur name':["janu","kanu","onu","adce","dolu","fophia","galaba","fronke","feace","kolu","lulu"]
      , 'qualifications':["student","trader","teacher","photographer","librarian","bricklayer"
                          ,"plumber","politician","lecturer","minister","PRO"]
       ,'age': [23,24,25,26,27,28,29,30,31,32,33]}
df6 = pd.DataFrame(clas)
df6

    age first name qualifications sur name
0    23     sophia        student     janu
1    24      alaba         trader     kanu
2    25      ronke        teacher      onu
3    26      peace   photographer     adce
4    27        olu      librarian     dolu
5    28       seth     bricklayer   fophia
6    29       laba        plumber   galaba
7    30       dike     politician   fronke
8    31     buhari       lecturer    feace
9    32       luke       minister     kolu
10   33        olu            PRO     lulu

In [22]:
df2.iloc[0]

NameError: name 'df2' is not defined

In [ ]:
df2[['sur name','first name','age','qualifications']]

In [ ]:
#indexing out columns in a dataframe
col = ["first name"]
df6[col]

In [ ]:
df2['valentine'] = "love"

In [ ]:
df2

In [ ]:
df6['full name'] = df6['first name'] + ' ' + df6['sur name']
df6

In [ ]:
#dropping a coloumn

df6.drop(['full name'], axis = 1)

#implace = true tells the python complier to save the changes to the dataframe
#for axis 0 = row , 1 = columns

In [ ]:
#How to select a row in Dataframe

In [ ]:
df6.loc[3]

Selection is the process of filtering a dataframe to include only the values that need the specified condition

In [ ]:
df6['age'] > 25

In [ ]:
df2

In [ ]:
df6[df6>25]

In [ ]:
df6[df6['age']>25]

In [ ]:
df6[df6['age']>30]

# Concatenating a database
Concantenating in pandas works like append function where a collection (dataframe or list) is added to another exciting one. 
A dataframe can be concatenated by rows or columns.

In [ ]:
import numpy as np
import pandas as pd

np.random.seed(4)
df1 = pd.DataFrame(np.random.randn(2,5),
                 columns = ["A", "B", "C", "D", "E"])
df1

In [ ]:
np.random.seed(7)
df2 = pd.DataFrame(np.random.randn(3,5),
                 columns = ["A", "B", "C", "D", "E"])
df2
#randn works with normal distribution of numbers

In [ ]:
pd.concat([df1,df2])

In [ ]:
pd.concat([df1,df2], axis = 1)

# Merging two dataframes
A dataframe can be merged in four ways: left, right, inner and outer. it operates similar to SQL join

-  left: use only keys from left frame, similar to a SQL left outer join, preserve key order.
-  right: use only keys from right frame, similar to a SQL right outer join, preserve key order.
-  outer: use union of keys from both frames , similar to SQL full outer join, sort key lexicographically
-  inner: use intersection of keys from both frames, similar to a SQL inner join preserve the order of the left

In [ ]:
left = pd.DataFrame({"key1":["K0","K0","K1","K1"], "key2":["K0","K1","K0","K1"], 
                     "A":["A0","A1","A2","A3"], "B":["B0","B1","B2","B3"]})

right =  pd.DataFrame ({"key1":["K0","K1","K1","K2"], "key2":["K0","K0","K0","K0"], 
                     "C":["C0","C1","C2","C3"], "D":["D0","D1","D2","D3"]})

In [ ]:
print(left)

In [ ]:
print(right)

In [ ]:
pd.merge(left , right,
        how = 'inner',
        on = ["key1","key2"])

In [ ]:
pd.merge(left , right,
        how = 'inner',
        on = ["key1"])

In [ ]:
left

In [ ]:
right

In [ ]:
pd.merge(left , right,
        how = 'inner',
        on = ["key2"])

# Groupby Method 
the groupby method aggregates a dataframe based on a particular column usually a column that contains categorical or discrete values is used to as the grouping column.

In [ ]:
data = {"clubs":["Liverpool","man_city","totenaum","wolves", "Arsenal","chelsea",
                "Liverpool","man_city","totenaum","wolves", "Arsenal","chelsea"], 
        
        "coach":["klopp","Guardola","Mourihno","Nuno","ljunberg","Lampard",
                "klopp","Guardola","Mourihno","Nuno","ljunberg","Lampard"], 
    
        "wins":[234,442,552,120,233,300,
               232,442,552,120,233,300]}
data_df = pd.DataFrame(data)
data_df

In [ ]:
data_group = data_df.groupby('clubs')

#computational operations can be performed on the grouped data

In [ ]:
data_group.mean()

In [ ]:
data_group.get_group('man_city')

In [ ]:
data_group.sum()

In [ ]:
# describe is used to give mathematical summary of a data frame
data_group.describe()

In [ ]:
for group, club in data_group:
    print('-----')
    print(group)
    print('-----')
    print(club)

# the apply method
just as its name suggests, it is used to appy a computation to a pandas object.

# Lambda method
are like functions but you can only use one computation for Lambda

In [ ]:
test = pd.read_csv("test-Copy1.csv")
test

In [ ]:
test.info()

In [ ]:
#frequency distribution of gender column
test['Gender'].value_counts()

In [ ]:
#checking the number of null values in each column
test.isnull().sum()

In [ ]:
#checking duplicate rows in the dataset

test[test.duplicated()]

In [ ]:
#frequency distribution of the marital_status column
test['Marital_Status'].value_counts()

# Cleaning the Dataset
Simply put data cleaning is making the columns within a dataset fit to the purpose you want to use it for
some of the columns we want to clean are
-  Occupation
-  Marital Status 
-  Product_Category_2
-  Product_Category_3

In [ ]:
test["Marital_Status"].replace([0,1], ['married','single'])

In [ ]:
test["Marital_Status"] = test["Marital_Status"].replace([0,1], ['married','single'])
test["Marital_Status"]

In [ ]:
test

In [ ]:
test['Product_Category_3'].value_counts()

In [ ]:
mod = test['Product_Category_3'].mode()[0]
mod

In [ ]:
#fill the empty rows in the 'Product_Category_3' and 'Product_Category_2'
test['Product_Category_2'].fillna(test['Product_Category_2'].mode())
test['Product_Category_3'].fillna(mod,implace = True)
test['Product_Category_2'].dropna(implace = True)

In [ ]:
test[test['Gender'] == 'M']

In [ ]:
# splitting the dataset into male and females
males = test[test['Gender'] == 'M']
females = test[test['Gender'] == 'F']

In [ ]:
females

In [ ]:
males

In [ ]:
data_cit_cat_BC = test[test['City_Category'].isin(['C','B'])]

#alternatively you can also use the groupby method

group_test = test.groupby('Gender')
female_g = group_test.get_group('F')
male_g = group_test.get_group('M')

In [ ]:
#normalize = True method outputs the percentage of the female
females['Marital_Status'].value_counts(normalize = True)*100

In [ ]:
#different ways to achieve the same result
group_test['Marital_Status'].value_counts(normalize = True)*100

In [ ]:
married = test[test['Marital_Status'] == 'married']

In [ ]:
mar_and_b = married[married['City_Category'] == 'B']

In [ ]:
mar_b_male = mar_and_b[mar_and_b['Gender'] == 'M']

In [ ]:
mar_b_male['Age'].value_counts()

# Dataframe computations
Some of the methods that will be used in a dataframe include:

-  drop(): this is used to delete rows or columns
-  value_counts(): used to return the frequency distribution of a series.
-  unique(): used to return the unique items in a series
-  nunique(): used to output the number of unique items in a series.
-  keys()/columns: returns the names of the columns within a dataframe
-  head(): returns the first five rows of a dataframe (by default)
-  tail(): returns the last five rows of a dataframe (by default)
-  dropna(): deletes the empty rows in a dataframe
-  isnull(): used to know the empty rows in a dataframe
-  fillna(): is used to fill the empty rows in a dataframe
-  sort_values(): used to sort a dataframe by a column

In [ ]:
test = pd.read_csv("test-Copy1.csv")
test

In [ ]:
test["Occupation"] = test["Occupation"].replace([0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20], 
                        ['banker','data scientists','developer',"Mail man","civil engineer",'Police man','Web designer',
'Data architect','Agriculturist','Doctor','Nurse','Midwife','Mathematician','Psychologist','Astronaut','Neurosurgeon','Graphic desginer',
'artist','Chemist','Physicist','Biologist'])
test["Occupation"]

In [ ]:
test